In [1]:
import pandas as pd

df = pd.DataFrame({
    "Name": ["Amit", "Neha", "John", "Riya"],
    "Age": [25, 30, 28, 26],
    "Salary": [50000, 60000, 55000, 52000],
    "Department": ["IT", "HR", "IT", "Sales"]
})

In [2]:
#select single Column
df["Name"]

0    Amit
1    Neha
2    John
3    Riya
Name: Name, dtype: object

In [5]:
#Select Multiple Columns
df[["Name","Age"]]

   Name  Age
0  Amit   25
1  Neha   30
2  John   28
3  Riya   26

In [7]:
#Row Selection
df.iloc[0]

Name           Amit
Age              25
Salary        50000
Department       IT
Name: 0, dtype: object

In [9]:
#multiple ROw selection
df.iloc[0:2]

   Name  Age  Salary Department
0  Amit   25   50000         IT
1  Neha   30   60000         HR

In [13]:
#specific Column
df.loc[0:2, ["Name", "Salary"]]

   Name  Salary
0  Amit   50000
1  Neha   60000
2  John   55000

In [15]:
#specific Column
df.loc[:1, ["Name", "Salary"]]

   Name  Salary
0  Amit   50000
1  Neha   60000

In [17]:
#Boolen indexing

df[df["Salary"]>55000]

   Name  Age  Salary Department
1  Neha   30   60000         HR

In [21]:
# 2. Salary with Department
df[(df["Salary"]>50000) & (df["Department"]=="HR")]

   Name  Age  Salary Department
1  Neha   30   60000         HR

In [25]:
#select specific salary
df.at[1,"Department"]

'HR'

In [28]:
#Position-based fast access.
df.iat[1,3]

'HR'

In [37]:
#Set index and Select
df.set_index("Age", inplace=True)
df

    Department
Age
25          IT
30          HR
28          IT
26       Sales

In [39]:
#check Column already set to a column
print(df.index)

Index([25, 30, 28, 26], dtype='int64', name='Age')

In [42]:
#Selecting Column using filter
df.filter(items=["Salary","Name"])

      Salary
Name
Amit   50000
Neha   60000

In [43]:
#selecting top two rows 
df.head(2)

      Salary
Name
Amit   50000
Neha   60000

In [46]:
#selecting bottom one row
df.tail(1)

      Salary
Name
Neha   60000

In [48]:
#Query Method

df = pd.DataFrame({
    "Name": ["Amit", "Neha", "John", "Riya"],
    "Age": [25, 30, 28, 26],
    "Salary": [50000, 60000, 55000, 52000],
    "Department": ["IT", "HR", "IT", "Sales"]
})

In [51]:
df.query("Department=='IT'")

   Name  Age  Salary Department
0  Amit   25   50000         IT
2  John   28   55000         IT

In [54]:
df.query("Salary > 50000 and Department=='IT'")

   Name  Age  Salary Department
2  John   28   55000         IT

In [55]:
#OR condition
df.query("Department == 'IT' or Department=='HR'")

   Name  Age  Salary Department
0  Amit   25   50000         IT
1  Neha   30   60000         HR
2  John   28   55000         IT

In [58]:
# Variable inside Query
value = 50000
df.query("Salary > @value")

   Name  Age  Salary Department
1  Neha   30   60000         HR
2  John   28   55000         IT
3  Riya   26   52000      Sales

In [60]:
#Select Specific column after Query
value = 55000
df.query("Salary > @value")[["Name","Salary"]]

   Name  Salary
1  Neha   60000